README.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-03-10 Sun 15:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nalude</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nasy">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Nalude</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org52fb36b">1. Prologue</a></li>
<li><a href="#org7d68fc4">2. Nalude</a></li>
<li><a href="#org575af9f">3. Structure of Functions</a>
<ul>
<li><a href="#orgfb2214f">3.1. Folds and Traversals</a></li>
<li><a href="#orgdb13613">3.2. Lists</a></li>
<li><a href="#org7ed6748">3.3. Miscellaneous</a></li>
<li><a href="#org754871b">3.4. String</a></li>
<li><a href="#org0176039">3.5. Specials</a></li>
<li><a href="#org1e910da">3.6. Tuples</a></li>
<li><a href="#org11941df">3.7. Zip and Unzip</a></li>
<li><a href="#org01f3445">3.8. Extra</a></li>
</ul>
</li>
<li><a href="#orgc36e43c">4. Get Start</a>
<ul>
<li><a href="#org7e93f5b">4.1. Install</a></li>
</ul>
</li>
<li><a href="#org0bca743">5. Epoligue</a>
<ul>
<li><a href="#orga7f2e7b">5.1. History</a>
<ul>
<li><a href="#orgc3a4cff">5.1.1. Version 0.3.0</a></li>
<li><a href="#org8064e77">5.1.2. Version 0.2.0</a></li>
<li><a href="#org27fb6c4">5.1.3. Version 0.1.0</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org52fb36b" class="outline-2">
<h2 id="org52fb36b"><span class="section-number-2">1</span> Prologue</h2>
<div class="outline-text-2" id="text-1">
<p>
I like Haskell, also hope some of the prelude functions in Haskell can be used in Python.
</p>

<p>
Wish you enjoy coding with nalude.
</p>
</div>
</div>

<div id="outline-container-org7d68fc4" class="outline-2">
<h2 id="org7d68fc4"><span class="section-number-2">2</span> Nalude</h2>
<div class="outline-text-2" id="text-2">
<p>
Nalude is a standard module, which is inspired by Haskell's Prelude.  Thus, nalude is also a
library of functional programming.
</p>

<p>
Nalude doesn't explicitly distinguish between Applicative's or monadic function since they are not
well differentiated in the basic structure of Python.  Of course, the main reason is that I am too
fresh.
</p>

<p>
The following functions, Nalude tries to implement:
</p>

<ol class="org-ol">
<li>Folds and Traversals</li>
<li>Lists</li>
<li>Miscellaneous</li>
<li>Specials</li>
<li>Strings</li>
<li>Tuples</li>
<li>Zip and Unzip</li>
</ol>

<p>
At the same time, it also implements some functions which are only available in Python and are
included in `extra`.
</p>
</div>
</div>

<div id="outline-container-org575af9f" class="outline-2">
<h2 id="org575af9f"><span class="section-number-2">3</span> Structure of Functions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfb2214f" class="outline-3">
<h3 id="orgfb2214f"><span class="section-number-3">3.1</span> Folds and Traversals</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt>foldr(f: Callable[[b, a], b], init: b, t: Sequence[a])</dt><dd>Right-associative fold of a sequence.</dd>
<dt>foldl(f, init, t)</dt><dd>Left-associative fold of an iterable.  The same as <code>reduce</code>.</dd>
<dt>foldr1(f, t)</dt><dd>A variant of foldr without base case.</dd>
<dt>foldl1(f, t)</dt><dd>A variant of foldl without base case.</dd>
<dt>product(nums)</dt><dd>Computes the product of the numbers.</dd>
<dt>(HELP WANTED) traverse</dt><dd>Map each element of a structure to an action, evaluate these actions
from left to right, and collect the results.</dd>
<dt>(HELP WANTED) sequence</dt><dd>Evaluate each actions in the structure from left to right, and collect
the results.</dd>
</dl>
</div>
</div>
<div id="outline-container-orgdb13613" class="outline-3">
<h3 id="orgdb13613"><span class="section-number-3">3.2</span> Lists</h3>
<div class="outline-text-3" id="text-3-2">
<dl class="org-dl">
<dt>head(xs)</dt><dd>Extract the first element of an iterable.</dd>
<dt>last(xs)</dt><dd>Extract the last element of an iterable.</dd>
<dt>null(xs)</dt><dd>Test whether the sequence is empty.</dd>
<dt>(no term)</dt><dd>Infinite lists
<dl class="org-dl">
<dt>iterate(f, x)</dt><dd>Yield a tuple of repeated applications of f to x.</dd>
<dt>repeat(x)</dt><dd>Repeat x.</dd>
<dt>replicate(n, x)</dt><dd>Return a list of length n with x the value of every element.</dd>
<dt>cycle(xs)</dt><dd>Tie an iterable to infinite circuler one.</dd>

<dt>(no term)</dt><dd>Sublists

<dl class="org-dl">
<dt>tail(xs)</dt><dd>Extract the elements after the head of a list.</dd>
<dt>init(xs)</dt><dd>Extract all the elements of an iterable except the last one.</dd>
<dt>take(n, xs)</dt><dd>Return the first n elements of sequence xs.</dd>
<dt>drop(n, xs)</dt><dd>Return the remaining elements of xs after the first n elements.</dd>
<dt>splitat(n, xs)</dt><dd>Return a tuple where the first element is xs prefix of length n and
second element is the remainder of the sequence xs.</dd>
<dt>takewhile(p, xs)</dt><dd>Return the longest prefix of xs of elements that satisfy predicate p.</dd>
<dt>dropwhile(p, xs)</dt><dd>Return the suffix remaining after takewhile(p, xs).</dd>
<dt>(LAZY ONE HELP WANTED) span(p, xs)</dt><dd>Equal to (takewhile(p, xs), dropwhile(p, xs)).</dd>
<dt>(LAZY ONE HELP WANTED) break_(p, xs)</dt><dd>Equal to (takewhile(not_(p), xs),
dropwhile(not_(p), xs)).</dd>
</dl></dd>
</dl></dd>
</dl>
</div>
</div>

<div id="outline-container-org7ed6748" class="outline-3">
<h3 id="org7ed6748"><span class="section-number-3">3.3</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-3-3">
<dl class="org-dl">
<dt>id_(x)</dt><dd>Identity function.</dd>
<dt>const(x, _)</dt><dd>Evaluates to x for all inputs.</dd>
<dt>o(f1, f2)</dt><dd>(.) Function composition</dd>
<dt>flip(f)</dt><dd>Flip takes its two arguments into the reverse order of f.</dd>
<dt>until(p, f, x)</dt><dd>Yield the result of applying f until p holds.</dd>
</dl>
</div>
</div>

<div id="outline-container-org754871b" class="outline-3">
<h3 id="org754871b"><span class="section-number-3">3.4</span> String</h3>
<div class="outline-text-3" id="text-3-4">
<dl class="org-dl">
<dt>lines(s)</dt><dd>Break up a string into a list of strings at newline characters.</dd>
<dt>unlines(xs)</dt><dd>The inverse operation of lines, append a newline to each.</dd>
<dt>words(s)</dt><dd>Break a string up into a list of words, which were delimited by white space.</dd>
<dt>unwords(xs)</dt><dd>The inverse operation of words, join words with space.</dd>
</dl>
</div>
</div>

<div id="outline-container-org0176039" class="outline-3">
<h3 id="org0176039"><span class="section-number-3">3.5</span> Specials</h3>
<div class="outline-text-3" id="text-3-5">
<dl class="org-dl">
<dt>not_(f)</dt><dd>Boolean "not".</dd>
<dt>all_(p, xs)</dt><dd>Determine whether all elements of the structure satisfy the p.</dd>
<dt>any_(p, xs)</dt><dd>Determine whether sny elements of the structure satisfies the p.</dd>
<dt>concat(xss)</dt><dd>The concatenation of all the elements of a container of Sequences.</dd>
<dt>concatmap(f, xss)</dt><dd>Map a function over all the elements of a container and concatenate the
resulting lists.</dd>
</dl>
</div>
</div>

<div id="outline-container-org1e910da" class="outline-3">
<h3 id="org1e910da"><span class="section-number-3">3.6</span> Tuples</h3>
<div class="outline-text-3" id="text-3-6">
<dl class="org-dl">
<dt>fst(t)</dt><dd>Extract the first component of a tuple.</dd>
<dt>snd(t)</dt><dd>Extract the second component of a tuple.</dd>
<dt>curry(f, a, b)</dt><dd>Converts an uncurried function to a curried function.</dd>
<dt>uncurry(f, ab@(a, b))</dt><dd>Converts a curried function to a function on pairs.</dd>
</dl>
</div>
</div>

<div id="outline-container-org11941df" class="outline-3">
<h3 id="org11941df"><span class="section-number-3">3.7</span> Zip and Unzip</h3>
<div class="outline-text-3" id="text-3-7">
<dl class="org-dl">
<dt>zipwith(f, *seqs)</dt><dd>Zipwith is map(f, zip), but f accept separate args instead of tuple</dd>
<dt>unzip(pairs)</dt><dd>Transform an iterable of pairs into a tuple of sequence. (Not lazy)</dd>
</dl>
</div>
</div>

<div id="outline-container-org01f3445" class="outline-3">
<h3 id="org01f3445"><span class="section-number-3">3.8</span> Extra</h3>
<div class="outline-text-3" id="text-3-8">
<dl class="org-dl">
<dt>flatten(xs,*,ignore=(dict,))</dt><dd>Flatten iterables of iterable to a single iterable.  It will
ignore instances in <code>ignore</code> tuple.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgc36e43c" class="outline-2">
<h2 id="orgc36e43c"><span class="section-number-2">4</span> Get Start</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7e93f5b" class="outline-3">
<h3 id="org7e93f5b"><span class="section-number-3">4.1</span> Install</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-zsh">pip install nalude
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0bca743" class="outline-2">
<h2 id="org0bca743"><span class="section-number-2">5</span> Epoligue</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga7f2e7b" class="outline-3">
<h3 id="orga7f2e7b"><span class="section-number-3">5.1</span> History</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgc3a4cff" class="outline-4">
<h4 id="orgc3a4cff"><span class="section-number-4">5.1.1</span> Version 0.3.0</h4>
<div class="outline-text-4" id="text-5-1-1">
<dl class="org-dl">
<dt>Data</dt><dd><span class="timestamp-wrapper"><span class="timestamp">&lt;Sun Mar 10, 2019&gt;</span></span></dd>
<dt>Add</dt><dd><ul class="org-ul">
<li>Custom ignore when flatten iterable.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org8064e77" class="outline-4">
<h4 id="org8064e77"><span class="section-number-4">5.1.2</span> Version 0.2.0</h4>
<div class="outline-text-4" id="text-5-1-2">
<dl class="org-dl">
<dt>Data</dt><dd><span class="timestamp-wrapper"><span class="timestamp">&lt;Fri Feb 15, 2019&gt;</span></span></dd>
<dt>Add</dt><dd><ul class="org-ul">
<li>flatten in extra.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-org27fb6c4" class="outline-4">
<h4 id="org27fb6c4"><span class="section-number-4">5.1.3</span> Version 0.1.0</h4>
<div class="outline-text-4" id="text-5-1-3">
<dl class="org-dl">
<dt>Data</dt><dd><span class="timestamp-wrapper"><span class="timestamp">&lt;Wed Feb 06, 2019&gt;</span></span></dd>
<dt>Commemorate Version</dt><dd>First Release.</dd>
</dl>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-01-30 Wed 00:00</p>
<p class="author">Author: Nasy</p>
<p class="date">Created: 2019-03-10 Sun 15:50</p>
<p class="validation"></p>
</div>
</body>
</html>
